#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/protoconf-boutique/configs/runs/run-FU8KNu9HoBwdR8Hj

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tfe_organization.protoconf-boutique: Refreshing state... [id=protoconf-boutique]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_workspace.vpc-us-west-1 will be created
  + resource "tfe_workspace" "vpc-us-west-1" {
      + allow_destroy_plan            = true
      + auto_apply                    = true
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "vpc-us-west-1"
      + operations                    = (known after apply)
      + organization                  = "protoconf-boutique"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = (known after apply)
      + terraform_version             = (known after apply)
      + working_directory             = "tfconfigs/vpc-us-west-1"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @smintz, Action: `pull_request`*